{"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28], "dtype": "float32", "sparse": false, "ragged": false, "name": "flatten_input"}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "batch_input_shape": [null, 28, 28], "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "DenseFlipout", "config": {"name": "dense_flipout", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "activity_regularizer": null, "kernel_posterior_fn": ["4wUAAAAAAAAAAAAAAAkAAAAGAAAAEwAAAHNUAAAAiAB8AHwBfAJ8A3wEgwUvAn0FfQZ8BmQBdQBy\nFXQAagF8BWQCjQF9B24HdAJqA3wFfAZkA40CfQd0BKAFfAegBqEAoQF9CHQHagh8B3wIZASNAlMA\nKQXhcwIAAENyZWF0ZXMgbXVsdGl2YXJpYXRlIGBEZXRlcm1pbmlzdGljYCBvciBgTm9ybWFsYCBk\naXN0cmlidXRpb24uCgogICAgQXJnczoKICAgICAgZHR5cGU6IFR5cGUgb2YgcGFyYW1ldGVyJ3Mg\nZXZlbnQuCiAgICAgIHNoYXBlOiBQeXRob24gYGxpc3RgLWxpa2UgcmVwcmVzZW50aW5nIHRoZSBw\nYXJhbWV0ZXIncyBldmVudCBzaGFwZS4KICAgICAgbmFtZTogUHl0aG9uIGBzdHJgIG5hbWUgcHJl\ncGVuZGVkIHRvIGFueSBjcmVhdGVkIChvciBleGlzdGluZykKICAgICAgICBgdGYuVmFyaWFibGVg\ncy4KICAgICAgdHJhaW5hYmxlOiBQeXRob24gYGJvb2xgIGluZGljYXRpbmcgYWxsIGNyZWF0ZWQg\nYHRmLlZhcmlhYmxlYHMgc2hvdWxkIGJlCiAgICAgICAgYWRkZWQgdG8gdGhlIGdyYXBoIGNvbGxl\nY3Rpb24gYEdyYXBoS2V5cy5UUkFJTkFCTEVfVkFSSUFCTEVTYC4KICAgICAgYWRkX3ZhcmlhYmxl\nX2ZuOiBgdGYuZ2V0X3ZhcmlhYmxlYC1saWtlIGBjYWxsYWJsZWAgdXNlZCB0byBjcmVhdGUgKG9y\nCiAgICAgICAgYWNjZXNzIGV4aXN0aW5nKSBgdGYuVmFyaWFibGVgcy4KCiAgICBSZXR1cm5zOgog\nICAgICBNdWx0aXZhcmlhdGUgYERldGVybWluaXN0aWNgIG9yIGBOb3JtYWxgIGRpc3RyaWJ1dGlv\nbi4KICAgIE4pAdoDbG9jqQJyAgAAANoFc2NhbGWpAdoZcmVpbnRlcnByZXRlZF9iYXRjaF9uZGlt\ncykJ2hFkZXRlcm1pbmlzdGljX2xpYtoNRGV0ZXJtaW5pc3RpY9oKbm9ybWFsX2xpYtoGTm9ybWFs\n2gJ0ZtoEc2l6ZdoSYmF0Y2hfc2hhcGVfdGVuc29y2g9pbmRlcGVuZGVudF9saWLaC0luZGVwZW5k\nZW50KQnaBWR0eXBl2gVzaGFwZdoEbmFtZdoJdHJhaW5hYmxl2g9hZGRfdmFyaWFibGVfZm5yAgAA\nAHIEAAAA2gRkaXN02gtiYXRjaF9uZGltc6kBWgxsb2Nfc2NhbGVfZm6pAPpvQzovVXNlcnMvSG9t\nL2FuYWNvbmRhMy9lbnZzL3RvcmNoX2FuZF90ZW5zb3JmbG93L2xpYi9zaXRlLXBhY2thZ2VzL3Rl\nbnNvcmZsb3dfcHJvYmFiaWxpdHkvcHl0aG9uL2xheWVycy91dGlsLnB52gNfZm6rAAAAcxAAAAAU\nEAgBDgEOAg4BBAEEAQb/\n", null, ["_fn"]], "kernel_posterior_fn_type": "lambda", "kernel_posterior_tensor_fn": ["4wEAAAAAAAAAAAAAAAEAAAACAAAAQwAAAPMIAAAAfACgAKEAUwCpAU6pAdoGc2FtcGxlqQHaAWSp\nAHIHAAAA+nxDOi9Vc2Vycy9Ib20vYW5hY29uZGEzL2VudnMvdG9yY2hfYW5kX3RlbnNvcmZsb3cv\nbGliL3NpdGUtcGFja2FnZXMvdGVuc29yZmxvd19wcm9iYWJpbGl0eS9weXRob24vbGF5ZXJzL2Rl\nbnNlX3ZhcmlhdGlvbmFsLnB52gg8bGFtYmRhPncCAADzAgAAAAgA\n", null, null], "kernel_posterior_tensor_fn_type": "lambda", "kernel_prior_fn": ["4wUAAAAAAAAAAAAAAAcAAAAFAAAAQwAAAHM+AAAAfgJ+A34EdABqAXQCoAN8AXwAoQJ8AKAEZAGh\nAWQCjQJ9BXQCoAV8BaAGoQChAX0GdAdqCHwFfAZkA40CUwApBOFHAgAAQ3JlYXRlcyBtdWx0aXZh\ncmlhdGUgc3RhbmRhcmQgYE5vcm1hbGAgZGlzdHJpYnV0aW9uLgoKICBBcmdzOgogICAgZHR5cGU6\nIFR5cGUgb2YgcGFyYW1ldGVyJ3MgZXZlbnQuCiAgICBzaGFwZTogUHl0aG9uIGBsaXN0YC1saWtl\nIHJlcHJlc2VudGluZyB0aGUgcGFyYW1ldGVyJ3MgZXZlbnQgc2hhcGUuCiAgICBuYW1lOiBQeXRo\nb24gYHN0cmAgbmFtZSBwcmVwZW5kZWQgdG8gYW55IGNyZWF0ZWQgKG9yIGV4aXN0aW5nKQogICAg\nICBgdGYuVmFyaWFibGVgcy4KICAgIHRyYWluYWJsZTogUHl0aG9uIGBib29sYCBpbmRpY2F0aW5n\nIGFsbCBjcmVhdGVkIGB0Zi5WYXJpYWJsZWBzIHNob3VsZCBiZQogICAgICBhZGRlZCB0byB0aGUg\nZ3JhcGggY29sbGVjdGlvbiBgR3JhcGhLZXlzLlRSQUlOQUJMRV9WQVJJQUJMRVNgLgogICAgYWRk\nX3ZhcmlhYmxlX2ZuOiBgdGYuZ2V0X3ZhcmlhYmxlYC1saWtlIGBjYWxsYWJsZWAgdXNlZCB0byBj\ncmVhdGUgKG9yCiAgICAgIGFjY2VzcyBleGlzdGluZykgYHRmLlZhcmlhYmxlYHMuCgogIFJldHVy\nbnM6CiAgICBNdWx0aXZhcmlhdGUgc3RhbmRhcmQgYE5vcm1hbGAgZGlzdHJpYnV0aW9uLgogIOkB\nAAAAqQLaA2xvY9oFc2NhbGWpAdoZcmVpbnRlcnByZXRlZF9iYXRjaF9uZGltcykJ2gpub3JtYWxf\nbGli2gZOb3JtYWzaAnRm2gV6ZXJvc9oOYXNfbnVtcHlfZHR5cGXaBHNpemXaEmJhdGNoX3NoYXBl\nX3RlbnNvctoPaW5kZXBlbmRlbnRfbGli2gtJbmRlcGVuZGVudCkH2gVkdHlwZdoFc2hhcGXaBG5h\nbWXaCXRyYWluYWJsZdoPYWRkX3ZhcmlhYmxlX2Zu2gRkaXN02gtiYXRjaF9uZGltc6kAchgAAAD6\nb0M6L1VzZXJzL0hvbS9hbmFjb25kYTMvZW52cy90b3JjaF9hbmRfdGVuc29yZmxvdy9saWIvc2l0\nZS1wYWNrYWdlcy90ZW5zb3JmbG93X3Byb2JhYmlsaXR5L3B5dGhvbi9sYXllcnMvdXRpbC5wedoe\nZGVmYXVsdF9tdWx0aXZhcmlhdGVfbm9ybWFsX2ZuxgAAAHMQAAAABhEEARIBBv8OAgQBBAEG/w==\n", null, null], "kernel_prior_fn_type": "lambda", "kernel_divergence_fn": ["4wMAAAAAAAAAAAAAAAMAAAAFAAAAQwAAAHMiAAAAdABqAaACfAB8AaECdAOgBHQFagZkARkAdANq\nB6ECGwBTACkCTukAAAAAKQjaA3RmcNoNZGlzdHJpYnV0aW9uc9oNa2xfZGl2ZXJnZW5jZdoCdGba\nBGNhc3TaDHRyYWluX2ltYWdlc9oFc2hhcGXaB2Zsb2F0MzIpA9oBcdoBcNoBX6kAcg0AAAD6NEM6\nL1VzZXJzL0hvbS9QeWNoYXJtUHJvamVjdHMvRnVzaW9uUHJvamVjdC9ibm5fdmkucHnaCDxsYW1i\nZGE+PAAAAHMCAAAAIgA=\n", null, null], "kernel_divergence_fn_type": "lambda", "bias_posterior_fn": ["4wUAAAAAAAAAAAAAAAkAAAAGAAAAEwAAAHNUAAAAiAB8AHwBfAJ8A3wEgwUvAn0FfQZ8BmQBdQBy\nFXQAagF8BWQCjQF9B24HdAJqA3wFfAZkA40CfQd0BKAFfAegBqEAoQF9CHQHagh8B3wIZASNAlMA\nKQXhcwIAAENyZWF0ZXMgbXVsdGl2YXJpYXRlIGBEZXRlcm1pbmlzdGljYCBvciBgTm9ybWFsYCBk\naXN0cmlidXRpb24uCgogICAgQXJnczoKICAgICAgZHR5cGU6IFR5cGUgb2YgcGFyYW1ldGVyJ3Mg\nZXZlbnQuCiAgICAgIHNoYXBlOiBQeXRob24gYGxpc3RgLWxpa2UgcmVwcmVzZW50aW5nIHRoZSBw\nYXJhbWV0ZXIncyBldmVudCBzaGFwZS4KICAgICAgbmFtZTogUHl0aG9uIGBzdHJgIG5hbWUgcHJl\ncGVuZGVkIHRvIGFueSBjcmVhdGVkIChvciBleGlzdGluZykKICAgICAgICBgdGYuVmFyaWFibGVg\ncy4KICAgICAgdHJhaW5hYmxlOiBQeXRob24gYGJvb2xgIGluZGljYXRpbmcgYWxsIGNyZWF0ZWQg\nYHRmLlZhcmlhYmxlYHMgc2hvdWxkIGJlCiAgICAgICAgYWRkZWQgdG8gdGhlIGdyYXBoIGNvbGxl\nY3Rpb24gYEdyYXBoS2V5cy5UUkFJTkFCTEVfVkFSSUFCTEVTYC4KICAgICAgYWRkX3ZhcmlhYmxl\nX2ZuOiBgdGYuZ2V0X3ZhcmlhYmxlYC1saWtlIGBjYWxsYWJsZWAgdXNlZCB0byBjcmVhdGUgKG9y\nCiAgICAgICAgYWNjZXNzIGV4aXN0aW5nKSBgdGYuVmFyaWFibGVgcy4KCiAgICBSZXR1cm5zOgog\nICAgICBNdWx0aXZhcmlhdGUgYERldGVybWluaXN0aWNgIG9yIGBOb3JtYWxgIGRpc3RyaWJ1dGlv\nbi4KICAgIE4pAdoDbG9jqQJyAgAAANoFc2NhbGWpAdoZcmVpbnRlcnByZXRlZF9iYXRjaF9uZGlt\ncykJ2hFkZXRlcm1pbmlzdGljX2xpYtoNRGV0ZXJtaW5pc3RpY9oKbm9ybWFsX2xpYtoGTm9ybWFs\n2gJ0ZtoEc2l6ZdoSYmF0Y2hfc2hhcGVfdGVuc29y2g9pbmRlcGVuZGVudF9saWLaC0luZGVwZW5k\nZW50KQnaBWR0eXBl2gVzaGFwZdoEbmFtZdoJdHJhaW5hYmxl2g9hZGRfdmFyaWFibGVfZm5yAgAA\nAHIEAAAA2gRkaXN02gtiYXRjaF9uZGltc6kBWgxsb2Nfc2NhbGVfZm6pAPpvQzovVXNlcnMvSG9t\nL2FuYWNvbmRhMy9lbnZzL3RvcmNoX2FuZF90ZW5zb3JmbG93L2xpYi9zaXRlLXBhY2thZ2VzL3Rl\nbnNvcmZsb3dfcHJvYmFiaWxpdHkvcHl0aG9uL2xheWVycy91dGlsLnB52gNfZm6rAAAAcxAAAAAU\nEAgBDgEOAg4BBAEEAQb/\n", null, ["_fn"]], "bias_posterior_fn_type": "lambda", "bias_posterior_tensor_fn": ["4wEAAAAAAAAAAAAAAAEAAAACAAAAQwAAAPMIAAAAfACgAKEAUwCpAU6pAdoGc2FtcGxlqQHaAWSp\nAHIHAAAA+nxDOi9Vc2Vycy9Ib20vYW5hY29uZGEzL2VudnMvdG9yY2hfYW5kX3RlbnNvcmZsb3cv\nbGliL3NpdGUtcGFja2FnZXMvdGVuc29yZmxvd19wcm9iYWJpbGl0eS9weXRob24vbGF5ZXJzL2Rl\nbnNlX3ZhcmlhdGlvbmFsLnB52gg8bGFtYmRhPnwCAADzAgAAAAgA\n", null, null], "bias_posterior_tensor_fn_type": "lambda", "bias_prior_fn": null, "bias_prior_fn_type": null, "bias_divergence_fn": ["4wMAAAAAAAAAAAAAAAMAAAAEAAAAQwAAAPMMAAAAdACgAXwAfAGhAlMAqQFOqQLaBmtsX2xpYtoN\na2xfZGl2ZXJnZW5jZakD2gFx2gFw2gZpZ25vcmWpAHIKAAAA+nxDOi9Vc2Vycy9Ib20vYW5hY29u\nZGEzL2VudnMvdG9yY2hfYW5kX3RlbnNvcmZsb3cvbGliL3NpdGUtcGFja2FnZXMvdGVuc29yZmxv\nd19wcm9iYWJpbGl0eS9weXRob24vbGF5ZXJzL2RlbnNlX3ZhcmlhdGlvbmFsLnB52gg8bGFtYmRh\nPn4CAADzAgAAAAwA\n", null, null], "bias_divergence_fn_type": "lambda", "seed": null}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}}, {"class_name": "DenseFlipout", "config": {"name": "dense_flipout_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "activity_regularizer": null, "kernel_posterior_fn": ["4wUAAAAAAAAAAAAAAAkAAAAGAAAAEwAAAHNUAAAAiAB8AHwBfAJ8A3wEgwUvAn0FfQZ8BmQBdQBy\nFXQAagF8BWQCjQF9B24HdAJqA3wFfAZkA40CfQd0BKAFfAegBqEAoQF9CHQHagh8B3wIZASNAlMA\nKQXhcwIAAENyZWF0ZXMgbXVsdGl2YXJpYXRlIGBEZXRlcm1pbmlzdGljYCBvciBgTm9ybWFsYCBk\naXN0cmlidXRpb24uCgogICAgQXJnczoKICAgICAgZHR5cGU6IFR5cGUgb2YgcGFyYW1ldGVyJ3Mg\nZXZlbnQuCiAgICAgIHNoYXBlOiBQeXRob24gYGxpc3RgLWxpa2UgcmVwcmVzZW50aW5nIHRoZSBw\nYXJhbWV0ZXIncyBldmVudCBzaGFwZS4KICAgICAgbmFtZTogUHl0aG9uIGBzdHJgIG5hbWUgcHJl\ncGVuZGVkIHRvIGFueSBjcmVhdGVkIChvciBleGlzdGluZykKICAgICAgICBgdGYuVmFyaWFibGVg\ncy4KICAgICAgdHJhaW5hYmxlOiBQeXRob24gYGJvb2xgIGluZGljYXRpbmcgYWxsIGNyZWF0ZWQg\nYHRmLlZhcmlhYmxlYHMgc2hvdWxkIGJlCiAgICAgICAgYWRkZWQgdG8gdGhlIGdyYXBoIGNvbGxl\nY3Rpb24gYEdyYXBoS2V5cy5UUkFJTkFCTEVfVkFSSUFCTEVTYC4KICAgICAgYWRkX3ZhcmlhYmxl\nX2ZuOiBgdGYuZ2V0X3ZhcmlhYmxlYC1saWtlIGBjYWxsYWJsZWAgdXNlZCB0byBjcmVhdGUgKG9y\nCiAgICAgICAgYWNjZXNzIGV4aXN0aW5nKSBgdGYuVmFyaWFibGVgcy4KCiAgICBSZXR1cm5zOgog\nICAgICBNdWx0aXZhcmlhdGUgYERldGVybWluaXN0aWNgIG9yIGBOb3JtYWxgIGRpc3RyaWJ1dGlv\nbi4KICAgIE4pAdoDbG9jqQJyAgAAANoFc2NhbGWpAdoZcmVpbnRlcnByZXRlZF9iYXRjaF9uZGlt\ncykJ2hFkZXRlcm1pbmlzdGljX2xpYtoNRGV0ZXJtaW5pc3RpY9oKbm9ybWFsX2xpYtoGTm9ybWFs\n2gJ0ZtoEc2l6ZdoSYmF0Y2hfc2hhcGVfdGVuc29y2g9pbmRlcGVuZGVudF9saWLaC0luZGVwZW5k\nZW50KQnaBWR0eXBl2gVzaGFwZdoEbmFtZdoJdHJhaW5hYmxl2g9hZGRfdmFyaWFibGVfZm5yAgAA\nAHIEAAAA2gRkaXN02gtiYXRjaF9uZGltc6kBWgxsb2Nfc2NhbGVfZm6pAPpvQzovVXNlcnMvSG9t\nL2FuYWNvbmRhMy9lbnZzL3RvcmNoX2FuZF90ZW5zb3JmbG93L2xpYi9zaXRlLXBhY2thZ2VzL3Rl\nbnNvcmZsb3dfcHJvYmFiaWxpdHkvcHl0aG9uL2xheWVycy91dGlsLnB52gNfZm6rAAAAcxAAAAAU\nEAgBDgEOAg4BBAEEAQb/\n", null, ["_fn"]], "kernel_posterior_fn_type": "lambda", "kernel_posterior_tensor_fn": ["4wEAAAAAAAAAAAAAAAEAAAACAAAAQwAAAPMIAAAAfACgAKEAUwCpAU6pAdoGc2FtcGxlqQHaAWSp\nAHIHAAAA+nxDOi9Vc2Vycy9Ib20vYW5hY29uZGEzL2VudnMvdG9yY2hfYW5kX3RlbnNvcmZsb3cv\nbGliL3NpdGUtcGFja2FnZXMvdGVuc29yZmxvd19wcm9iYWJpbGl0eS9weXRob24vbGF5ZXJzL2Rl\nbnNlX3ZhcmlhdGlvbmFsLnB52gg8bGFtYmRhPncCAADzAgAAAAgA\n", null, null], "kernel_posterior_tensor_fn_type": "lambda", "kernel_prior_fn": ["4wUAAAAAAAAAAAAAAAcAAAAFAAAAQwAAAHM+AAAAfgJ+A34EdABqAXQCoAN8AXwAoQJ8AKAEZAGh\nAWQCjQJ9BXQCoAV8BaAGoQChAX0GdAdqCHwFfAZkA40CUwApBOFHAgAAQ3JlYXRlcyBtdWx0aXZh\ncmlhdGUgc3RhbmRhcmQgYE5vcm1hbGAgZGlzdHJpYnV0aW9uLgoKICBBcmdzOgogICAgZHR5cGU6\nIFR5cGUgb2YgcGFyYW1ldGVyJ3MgZXZlbnQuCiAgICBzaGFwZTogUHl0aG9uIGBsaXN0YC1saWtl\nIHJlcHJlc2VudGluZyB0aGUgcGFyYW1ldGVyJ3MgZXZlbnQgc2hhcGUuCiAgICBuYW1lOiBQeXRo\nb24gYHN0cmAgbmFtZSBwcmVwZW5kZWQgdG8gYW55IGNyZWF0ZWQgKG9yIGV4aXN0aW5nKQogICAg\nICBgdGYuVmFyaWFibGVgcy4KICAgIHRyYWluYWJsZTogUHl0aG9uIGBib29sYCBpbmRpY2F0aW5n\nIGFsbCBjcmVhdGVkIGB0Zi5WYXJpYWJsZWBzIHNob3VsZCBiZQogICAgICBhZGRlZCB0byB0aGUg\nZ3JhcGggY29sbGVjdGlvbiBgR3JhcGhLZXlzLlRSQUlOQUJMRV9WQVJJQUJMRVNgLgogICAgYWRk\nX3ZhcmlhYmxlX2ZuOiBgdGYuZ2V0X3ZhcmlhYmxlYC1saWtlIGBjYWxsYWJsZWAgdXNlZCB0byBj\ncmVhdGUgKG9yCiAgICAgIGFjY2VzcyBleGlzdGluZykgYHRmLlZhcmlhYmxlYHMuCgogIFJldHVy\nbnM6CiAgICBNdWx0aXZhcmlhdGUgc3RhbmRhcmQgYE5vcm1hbGAgZGlzdHJpYnV0aW9uLgogIOkB\nAAAAqQLaA2xvY9oFc2NhbGWpAdoZcmVpbnRlcnByZXRlZF9iYXRjaF9uZGltcykJ2gpub3JtYWxf\nbGli2gZOb3JtYWzaAnRm2gV6ZXJvc9oOYXNfbnVtcHlfZHR5cGXaBHNpemXaEmJhdGNoX3NoYXBl\nX3RlbnNvctoPaW5kZXBlbmRlbnRfbGli2gtJbmRlcGVuZGVudCkH2gVkdHlwZdoFc2hhcGXaBG5h\nbWXaCXRyYWluYWJsZdoPYWRkX3ZhcmlhYmxlX2Zu2gRkaXN02gtiYXRjaF9uZGltc6kAchgAAAD6\nb0M6L1VzZXJzL0hvbS9hbmFjb25kYTMvZW52cy90b3JjaF9hbmRfdGVuc29yZmxvdy9saWIvc2l0\nZS1wYWNrYWdlcy90ZW5zb3JmbG93X3Byb2JhYmlsaXR5L3B5dGhvbi9sYXllcnMvdXRpbC5wedoe\nZGVmYXVsdF9tdWx0aXZhcmlhdGVfbm9ybWFsX2ZuxgAAAHMQAAAABhEEARIBBv8OAgQBBAEG/w==\n", null, null], "kernel_prior_fn_type": "lambda", "kernel_divergence_fn": ["4wMAAAAAAAAAAAAAAAMAAAAFAAAAQwAAAHMiAAAAdABqAaACfAB8AaECdAOgBHQFagZkARkAdANq\nB6ECGwBTACkCTukAAAAAKQjaA3RmcNoNZGlzdHJpYnV0aW9uc9oNa2xfZGl2ZXJnZW5jZdoCdGba\nBGNhc3TaDHRyYWluX2ltYWdlc9oFc2hhcGXaB2Zsb2F0MzIpA9oBcdoBcNoBX6kAcg0AAAD6NEM6\nL1VzZXJzL0hvbS9QeWNoYXJtUHJvamVjdHMvRnVzaW9uUHJvamVjdC9ibm5fdmkucHnaCDxsYW1i\nZGE+PAAAAHMCAAAAIgA=\n", null, null], "kernel_divergence_fn_type": "lambda", "bias_posterior_fn": ["4wUAAAAAAAAAAAAAAAkAAAAGAAAAEwAAAHNUAAAAiAB8AHwBfAJ8A3wEgwUvAn0FfQZ8BmQBdQBy\nFXQAagF8BWQCjQF9B24HdAJqA3wFfAZkA40CfQd0BKAFfAegBqEAoQF9CHQHagh8B3wIZASNAlMA\nKQXhcwIAAENyZWF0ZXMgbXVsdGl2YXJpYXRlIGBEZXRlcm1pbmlzdGljYCBvciBgTm9ybWFsYCBk\naXN0cmlidXRpb24uCgogICAgQXJnczoKICAgICAgZHR5cGU6IFR5cGUgb2YgcGFyYW1ldGVyJ3Mg\nZXZlbnQuCiAgICAgIHNoYXBlOiBQeXRob24gYGxpc3RgLWxpa2UgcmVwcmVzZW50aW5nIHRoZSBw\nYXJhbWV0ZXIncyBldmVudCBzaGFwZS4KICAgICAgbmFtZTogUHl0aG9uIGBzdHJgIG5hbWUgcHJl\ncGVuZGVkIHRvIGFueSBjcmVhdGVkIChvciBleGlzdGluZykKICAgICAgICBgdGYuVmFyaWFibGVg\ncy4KICAgICAgdHJhaW5hYmxlOiBQeXRob24gYGJvb2xgIGluZGljYXRpbmcgYWxsIGNyZWF0ZWQg\nYHRmLlZhcmlhYmxlYHMgc2hvdWxkIGJlCiAgICAgICAgYWRkZWQgdG8gdGhlIGdyYXBoIGNvbGxl\nY3Rpb24gYEdyYXBoS2V5cy5UUkFJTkFCTEVfVkFSSUFCTEVTYC4KICAgICAgYWRkX3ZhcmlhYmxl\nX2ZuOiBgdGYuZ2V0X3ZhcmlhYmxlYC1saWtlIGBjYWxsYWJsZWAgdXNlZCB0byBjcmVhdGUgKG9y\nCiAgICAgICAgYWNjZXNzIGV4aXN0aW5nKSBgdGYuVmFyaWFibGVgcy4KCiAgICBSZXR1cm5zOgog\nICAgICBNdWx0aXZhcmlhdGUgYERldGVybWluaXN0aWNgIG9yIGBOb3JtYWxgIGRpc3RyaWJ1dGlv\nbi4KICAgIE4pAdoDbG9jqQJyAgAAANoFc2NhbGWpAdoZcmVpbnRlcnByZXRlZF9iYXRjaF9uZGlt\ncykJ2hFkZXRlcm1pbmlzdGljX2xpYtoNRGV0ZXJtaW5pc3RpY9oKbm9ybWFsX2xpYtoGTm9ybWFs\n2gJ0ZtoEc2l6ZdoSYmF0Y2hfc2hhcGVfdGVuc29y2g9pbmRlcGVuZGVudF9saWLaC0luZGVwZW5k\nZW50KQnaBWR0eXBl2gVzaGFwZdoEbmFtZdoJdHJhaW5hYmxl2g9hZGRfdmFyaWFibGVfZm5yAgAA\nAHIEAAAA2gRkaXN02gtiYXRjaF9uZGltc6kBWgxsb2Nfc2NhbGVfZm6pAPpvQzovVXNlcnMvSG9t\nL2FuYWNvbmRhMy9lbnZzL3RvcmNoX2FuZF90ZW5zb3JmbG93L2xpYi9zaXRlLXBhY2thZ2VzL3Rl\nbnNvcmZsb3dfcHJvYmFiaWxpdHkvcHl0aG9uL2xheWVycy91dGlsLnB52gNfZm6rAAAAcxAAAAAU\nEAgBDgEOAg4BBAEEAQb/\n", null, ["_fn"]], "bias_posterior_fn_type": "lambda", "bias_posterior_tensor_fn": ["4wEAAAAAAAAAAAAAAAEAAAACAAAAQwAAAPMIAAAAfACgAKEAUwCpAU6pAdoGc2FtcGxlqQHaAWSp\nAHIHAAAA+nxDOi9Vc2Vycy9Ib20vYW5hY29uZGEzL2VudnMvdG9yY2hfYW5kX3RlbnNvcmZsb3cv\nbGliL3NpdGUtcGFja2FnZXMvdGVuc29yZmxvd19wcm9iYWJpbGl0eS9weXRob24vbGF5ZXJzL2Rl\nbnNlX3ZhcmlhdGlvbmFsLnB52gg8bGFtYmRhPnwCAADzAgAAAAgA\n", null, null], "bias_posterior_tensor_fn_type": "lambda", "bias_prior_fn": null, "bias_prior_fn_type": null, "bias_divergence_fn": ["4wMAAAAAAAAAAAAAAAMAAAAEAAAAQwAAAPMMAAAAdACgAXwAfAGhAlMAqQFOqQLaBmtsX2xpYtoN\na2xfZGl2ZXJnZW5jZakD2gFx2gFw2gZpZ25vcmWpAHIKAAAA+nxDOi9Vc2Vycy9Ib20vYW5hY29u\nZGEzL2VudnMvdG9yY2hfYW5kX3RlbnNvcmZsb3cvbGliL3NpdGUtcGFja2FnZXMvdGVuc29yZmxv\nd19wcm9iYWJpbGl0eS9weXRob24vbGF5ZXJzL2RlbnNlX3ZhcmlhdGlvbmFsLnB52gg8bGFtYmRh\nPn4CAADzAgAAAAwA\n", null, null], "bias_divergence_fn_type": "lambda", "seed": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}}, {"class_name": "DenseFlipout", "config": {"name": "dense_flipout_2", "trainable": true, "dtype": "float32", "units": 10, "activation": "linear", "activity_regularizer": null, "kernel_posterior_fn": ["4wUAAAAAAAAAAAAAAAkAAAAGAAAAEwAAAHNUAAAAiAB8AHwBfAJ8A3wEgwUvAn0FfQZ8BmQBdQBy\nFXQAagF8BWQCjQF9B24HdAJqA3wFfAZkA40CfQd0BKAFfAegBqEAoQF9CHQHagh8B3wIZASNAlMA\nKQXhcwIAAENyZWF0ZXMgbXVsdGl2YXJpYXRlIGBEZXRlcm1pbmlzdGljYCBvciBgTm9ybWFsYCBk\naXN0cmlidXRpb24uCgogICAgQXJnczoKICAgICAgZHR5cGU6IFR5cGUgb2YgcGFyYW1ldGVyJ3Mg\nZXZlbnQuCiAgICAgIHNoYXBlOiBQeXRob24gYGxpc3RgLWxpa2UgcmVwcmVzZW50aW5nIHRoZSBw\nYXJhbWV0ZXIncyBldmVudCBzaGFwZS4KICAgICAgbmFtZTogUHl0aG9uIGBzdHJgIG5hbWUgcHJl\ncGVuZGVkIHRvIGFueSBjcmVhdGVkIChvciBleGlzdGluZykKICAgICAgICBgdGYuVmFyaWFibGVg\ncy4KICAgICAgdHJhaW5hYmxlOiBQeXRob24gYGJvb2xgIGluZGljYXRpbmcgYWxsIGNyZWF0ZWQg\nYHRmLlZhcmlhYmxlYHMgc2hvdWxkIGJlCiAgICAgICAgYWRkZWQgdG8gdGhlIGdyYXBoIGNvbGxl\nY3Rpb24gYEdyYXBoS2V5cy5UUkFJTkFCTEVfVkFSSUFCTEVTYC4KICAgICAgYWRkX3ZhcmlhYmxl\nX2ZuOiBgdGYuZ2V0X3ZhcmlhYmxlYC1saWtlIGBjYWxsYWJsZWAgdXNlZCB0byBjcmVhdGUgKG9y\nCiAgICAgICAgYWNjZXNzIGV4aXN0aW5nKSBgdGYuVmFyaWFibGVgcy4KCiAgICBSZXR1cm5zOgog\nICAgICBNdWx0aXZhcmlhdGUgYERldGVybWluaXN0aWNgIG9yIGBOb3JtYWxgIGRpc3RyaWJ1dGlv\nbi4KICAgIE4pAdoDbG9jqQJyAgAAANoFc2NhbGWpAdoZcmVpbnRlcnByZXRlZF9iYXRjaF9uZGlt\ncykJ2hFkZXRlcm1pbmlzdGljX2xpYtoNRGV0ZXJtaW5pc3RpY9oKbm9ybWFsX2xpYtoGTm9ybWFs\n2gJ0ZtoEc2l6ZdoSYmF0Y2hfc2hhcGVfdGVuc29y2g9pbmRlcGVuZGVudF9saWLaC0luZGVwZW5k\nZW50KQnaBWR0eXBl2gVzaGFwZdoEbmFtZdoJdHJhaW5hYmxl2g9hZGRfdmFyaWFibGVfZm5yAgAA\nAHIEAAAA2gRkaXN02gtiYXRjaF9uZGltc6kBWgxsb2Nfc2NhbGVfZm6pAPpvQzovVXNlcnMvSG9t\nL2FuYWNvbmRhMy9lbnZzL3RvcmNoX2FuZF90ZW5zb3JmbG93L2xpYi9zaXRlLXBhY2thZ2VzL3Rl\nbnNvcmZsb3dfcHJvYmFiaWxpdHkvcHl0aG9uL2xheWVycy91dGlsLnB52gNfZm6rAAAAcxAAAAAU\nEAgBDgEOAg4BBAEEAQb/\n", null, ["_fn"]], "kernel_posterior_fn_type": "lambda", "kernel_posterior_tensor_fn": ["4wEAAAAAAAAAAAAAAAEAAAACAAAAQwAAAPMIAAAAfACgAKEAUwCpAU6pAdoGc2FtcGxlqQHaAWSp\nAHIHAAAA+nxDOi9Vc2Vycy9Ib20vYW5hY29uZGEzL2VudnMvdG9yY2hfYW5kX3RlbnNvcmZsb3cv\nbGliL3NpdGUtcGFja2FnZXMvdGVuc29yZmxvd19wcm9iYWJpbGl0eS9weXRob24vbGF5ZXJzL2Rl\nbnNlX3ZhcmlhdGlvbmFsLnB52gg8bGFtYmRhPncCAADzAgAAAAgA\n", null, null], "kernel_posterior_tensor_fn_type": "lambda", "kernel_prior_fn": ["4wUAAAAAAAAAAAAAAAcAAAAFAAAAQwAAAHM+AAAAfgJ+A34EdABqAXQCoAN8AXwAoQJ8AKAEZAGh\nAWQCjQJ9BXQCoAV8BaAGoQChAX0GdAdqCHwFfAZkA40CUwApBOFHAgAAQ3JlYXRlcyBtdWx0aXZh\ncmlhdGUgc3RhbmRhcmQgYE5vcm1hbGAgZGlzdHJpYnV0aW9uLgoKICBBcmdzOgogICAgZHR5cGU6\nIFR5cGUgb2YgcGFyYW1ldGVyJ3MgZXZlbnQuCiAgICBzaGFwZTogUHl0aG9uIGBsaXN0YC1saWtl\nIHJlcHJlc2VudGluZyB0aGUgcGFyYW1ldGVyJ3MgZXZlbnQgc2hhcGUuCiAgICBuYW1lOiBQeXRo\nb24gYHN0cmAgbmFtZSBwcmVwZW5kZWQgdG8gYW55IGNyZWF0ZWQgKG9yIGV4aXN0aW5nKQogICAg\nICBgdGYuVmFyaWFibGVgcy4KICAgIHRyYWluYWJsZTogUHl0aG9uIGBib29sYCBpbmRpY2F0aW5n\nIGFsbCBjcmVhdGVkIGB0Zi5WYXJpYWJsZWBzIHNob3VsZCBiZQogICAgICBhZGRlZCB0byB0aGUg\nZ3JhcGggY29sbGVjdGlvbiBgR3JhcGhLZXlzLlRSQUlOQUJMRV9WQVJJQUJMRVNgLgogICAgYWRk\nX3ZhcmlhYmxlX2ZuOiBgdGYuZ2V0X3ZhcmlhYmxlYC1saWtlIGBjYWxsYWJsZWAgdXNlZCB0byBj\ncmVhdGUgKG9yCiAgICAgIGFjY2VzcyBleGlzdGluZykgYHRmLlZhcmlhYmxlYHMuCgogIFJldHVy\nbnM6CiAgICBNdWx0aXZhcmlhdGUgc3RhbmRhcmQgYE5vcm1hbGAgZGlzdHJpYnV0aW9uLgogIOkB\nAAAAqQLaA2xvY9oFc2NhbGWpAdoZcmVpbnRlcnByZXRlZF9iYXRjaF9uZGltcykJ2gpub3JtYWxf\nbGli2gZOb3JtYWzaAnRm2gV6ZXJvc9oOYXNfbnVtcHlfZHR5cGXaBHNpemXaEmJhdGNoX3NoYXBl\nX3RlbnNvctoPaW5kZXBlbmRlbnRfbGli2gtJbmRlcGVuZGVudCkH2gVkdHlwZdoFc2hhcGXaBG5h\nbWXaCXRyYWluYWJsZdoPYWRkX3ZhcmlhYmxlX2Zu2gRkaXN02gtiYXRjaF9uZGltc6kAchgAAAD6\nb0M6L1VzZXJzL0hvbS9hbmFjb25kYTMvZW52cy90b3JjaF9hbmRfdGVuc29yZmxvdy9saWIvc2l0\nZS1wYWNrYWdlcy90ZW5zb3JmbG93X3Byb2JhYmlsaXR5L3B5dGhvbi9sYXllcnMvdXRpbC5wedoe\nZGVmYXVsdF9tdWx0aXZhcmlhdGVfbm9ybWFsX2ZuxgAAAHMQAAAABhEEARIBBv8OAgQBBAEG/w==\n", null, null], "kernel_prior_fn_type": "lambda", "kernel_divergence_fn": ["4wMAAAAAAAAAAAAAAAMAAAAFAAAAQwAAAHMiAAAAdABqAaACfAB8AaECdAOgBHQFagZkARkAdANq\nB6ECGwBTACkCTukAAAAAKQjaA3RmcNoNZGlzdHJpYnV0aW9uc9oNa2xfZGl2ZXJnZW5jZdoCdGba\nBGNhc3TaDHRyYWluX2ltYWdlc9oFc2hhcGXaB2Zsb2F0MzIpA9oBcdoBcNoBX6kAcg0AAAD6NEM6\nL1VzZXJzL0hvbS9QeWNoYXJtUHJvamVjdHMvRnVzaW9uUHJvamVjdC9ibm5fdmkucHnaCDxsYW1i\nZGE+PAAAAHMCAAAAIgA=\n", null, null], "kernel_divergence_fn_type": "lambda", "bias_posterior_fn": ["4wUAAAAAAAAAAAAAAAkAAAAGAAAAEwAAAHNUAAAAiAB8AHwBfAJ8A3wEgwUvAn0FfQZ8BmQBdQBy\nFXQAagF8BWQCjQF9B24HdAJqA3wFfAZkA40CfQd0BKAFfAegBqEAoQF9CHQHagh8B3wIZASNAlMA\nKQXhcwIAAENyZWF0ZXMgbXVsdGl2YXJpYXRlIGBEZXRlcm1pbmlzdGljYCBvciBgTm9ybWFsYCBk\naXN0cmlidXRpb24uCgogICAgQXJnczoKICAgICAgZHR5cGU6IFR5cGUgb2YgcGFyYW1ldGVyJ3Mg\nZXZlbnQuCiAgICAgIHNoYXBlOiBQeXRob24gYGxpc3RgLWxpa2UgcmVwcmVzZW50aW5nIHRoZSBw\nYXJhbWV0ZXIncyBldmVudCBzaGFwZS4KICAgICAgbmFtZTogUHl0aG9uIGBzdHJgIG5hbWUgcHJl\ncGVuZGVkIHRvIGFueSBjcmVhdGVkIChvciBleGlzdGluZykKICAgICAgICBgdGYuVmFyaWFibGVg\ncy4KICAgICAgdHJhaW5hYmxlOiBQeXRob24gYGJvb2xgIGluZGljYXRpbmcgYWxsIGNyZWF0ZWQg\nYHRmLlZhcmlhYmxlYHMgc2hvdWxkIGJlCiAgICAgICAgYWRkZWQgdG8gdGhlIGdyYXBoIGNvbGxl\nY3Rpb24gYEdyYXBoS2V5cy5UUkFJTkFCTEVfVkFSSUFCTEVTYC4KICAgICAgYWRkX3ZhcmlhYmxl\nX2ZuOiBgdGYuZ2V0X3ZhcmlhYmxlYC1saWtlIGBjYWxsYWJsZWAgdXNlZCB0byBjcmVhdGUgKG9y\nCiAgICAgICAgYWNjZXNzIGV4aXN0aW5nKSBgdGYuVmFyaWFibGVgcy4KCiAgICBSZXR1cm5zOgog\nICAgICBNdWx0aXZhcmlhdGUgYERldGVybWluaXN0aWNgIG9yIGBOb3JtYWxgIGRpc3RyaWJ1dGlv\nbi4KICAgIE4pAdoDbG9jqQJyAgAAANoFc2NhbGWpAdoZcmVpbnRlcnByZXRlZF9iYXRjaF9uZGlt\ncykJ2hFkZXRlcm1pbmlzdGljX2xpYtoNRGV0ZXJtaW5pc3RpY9oKbm9ybWFsX2xpYtoGTm9ybWFs\n2gJ0ZtoEc2l6ZdoSYmF0Y2hfc2hhcGVfdGVuc29y2g9pbmRlcGVuZGVudF9saWLaC0luZGVwZW5k\nZW50KQnaBWR0eXBl2gVzaGFwZdoEbmFtZdoJdHJhaW5hYmxl2g9hZGRfdmFyaWFibGVfZm5yAgAA\nAHIEAAAA2gRkaXN02gtiYXRjaF9uZGltc6kBWgxsb2Nfc2NhbGVfZm6pAPpvQzovVXNlcnMvSG9t\nL2FuYWNvbmRhMy9lbnZzL3RvcmNoX2FuZF90ZW5zb3JmbG93L2xpYi9zaXRlLXBhY2thZ2VzL3Rl\nbnNvcmZsb3dfcHJvYmFiaWxpdHkvcHl0aG9uL2xheWVycy91dGlsLnB52gNfZm6rAAAAcxAAAAAU\nEAgBDgEOAg4BBAEEAQb/\n", null, ["_fn"]], "bias_posterior_fn_type": "lambda", "bias_posterior_tensor_fn": ["4wEAAAAAAAAAAAAAAAEAAAACAAAAQwAAAPMIAAAAfACgAKEAUwCpAU6pAdoGc2FtcGxlqQHaAWSp\nAHIHAAAA+nxDOi9Vc2Vycy9Ib20vYW5hY29uZGEzL2VudnMvdG9yY2hfYW5kX3RlbnNvcmZsb3cv\nbGliL3NpdGUtcGFja2FnZXMvdGVuc29yZmxvd19wcm9iYWJpbGl0eS9weXRob24vbGF5ZXJzL2Rl\nbnNlX3ZhcmlhdGlvbmFsLnB52gg8bGFtYmRhPnwCAADzAgAAAAgA\n", null, null], "bias_posterior_tensor_fn_type": "lambda", "bias_prior_fn": null, "bias_prior_fn_type": null, "bias_divergence_fn": ["4wMAAAAAAAAAAAAAAAMAAAAEAAAAQwAAAPMMAAAAdACgAXwAfAGhAlMAqQFOqQLaBmtsX2xpYtoN\na2xfZGl2ZXJnZW5jZakD2gFx2gFw2gZpZ25vcmWpAHIKAAAA+nxDOi9Vc2Vycy9Ib20vYW5hY29u\nZGEzL2VudnMvdG9yY2hfYW5kX3RlbnNvcmZsb3cvbGliL3NpdGUtcGFja2FnZXMvdGVuc29yZmxv\nd19wcm9iYWJpbGl0eS9weXRob24vbGF5ZXJzL2RlbnNlX3ZhcmlhdGlvbmFsLnB52gg8bGFtYmRh\nPn4CAADzAgAAAAwA\n", null, null], "bias_divergence_fn_type": "lambda", "seed": null}}]}, "keras_version": "2.10.0", "backend": "tensorflow"}